provider/app/controllers/oauth_clients_controller.rb

SELECT * FROM "client_applications" WHERE ("client_applications".user_id = 1)
SELECT * FROM "oauth_tokens" WHERE ("oauth_tokens".user_id = 1 AND (oauth_tokens.invalidated_at is null and oauth_tokens.authorized_at is not null)) ORDER BY authorized_at desc
---
  def index
    @client_applications = current_user.client_applications
    @tokens = current_user.tokens.find :all, :conditions => 'oauth_tokens.invalidated_at is null and oauth_tokens.authorized_at is not null'

INSERT INTO "client_applications" ("name", "url", "support_url", "callback_url", "key", "secret", "user_id", "created_at", "updated_at") VALUES('company', 'http://localhost:3001/', 'http://localhost:3001/', 'http://localhost:3001/accept', 'izXS0c1kE2BXd9Lt95sD', 'VWhyk1HGE10iX8KhVhmt9wzSvHIGcS1BsMvdjswb', 1, '2009-10-15 11:06:35', '2009-10-15 11:06:35')
---
  def create
    @client_application = current_user.client_applications.build(params[:client_application])
    if @client_application.save

UPDATE "client_applications" SET "callback_url" = 'http://localhost:3001/callback', "updated_at" = '2009-10-15 11:20:43' WHERE "id" = 1
---
  def update
    if @client_application.update_attributes(params[:client_application])