provider/app/controllers/oauth_controller.rb

  def authorize
    @token = RequestToken.valid.find_by_token params[:oauth_token]
    if @token
      if request.post?
        if params.has_key?(:authorize)
          @token.authorize!(current_user)
          @redirect_url = @token.oob? ? @token.client_application.callback_url : @token.callback_url

          if @redirect_url
            redirect_to "#{@redirect_url}?oauth_token=#{@token.token}&oauth_verifier=#{@token.verifier}"
          else
            render :action => "authorize_success"
          end
        else
          @token.invalidate!
          render :action => "authorize_failure"
        end
      end

      # EXPERIMENTAL - QUICK AUTHENTICATION
      if request.get? and AccessToken.exists?(:user_id => current_user.id, :client_application_id => @token.client_application_id, :invalidated_at => nil)
---
SELECT * FROM "oauth_tokens" WHERE ("oauth_tokens"."token" = 'kIugymV2ayRTwUZOVDs5') AND ( ("oauth_tokens"."type" = 'RequestToken' ) ) LIMIT 1
SELECT "oauth_tokens".id FROM "oauth_tokens" WHERE ("oauth_tokens"."user_id" = 1 AND "oauth_tokens"."client_application_id" = 1 AND "oauth_tokens"."invalidated_at" IS NULL) AND ( ("oauth_tokens"."type" = 'AccessToken' ) ) LIMIT 1