provider/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "login", "crypted_password", "password_salt", "persistence_token", "login_count", "last_request_at", "last_login_at", "current_login_at", "last_login_ip", "current_login_ip", "name") VALUES('2009-10-16 16:40:05', '2009-10-16 16:40:05', 'dupa', '5cc24bdbdb253d7db205c9fc8ad862463b1560988429ca9b5b80ce4067786c29c332b63be9a5e5a34898961eae78d44fe248ed74215d3f57bb3cb14bd767ee33', 'zzj56Tldh1aTLuuMKrZv', 'da18cd7735a3c21676eb00e1eb1f93f7f9ed009d75d8a994c2990cfabe43c069ddd7a1bc11a33c5a7c229cc1dabd1168a0961231ad1ced73e587d17550c10ed6', 1, '2009-10-16 16:40:05', NULL, '2009-10-16 16:40:05', NULL, '127.0.0.1', NULL)