consumer/app/controllers/oauth_consumers_controller.rb

SELECT * FROM "consumer_tokens"
---
  def index
    @consumer_tokens = ConsumerToken.all