consumer/app/controllers/oauth_consumers_controller.rb

  def callback
    session["request_token_secrets"] ||= {}
    @request_token_secret = session["request_token_secrets"][params[:oauth_token]]
    session.delete("request_token_secrets")
    if @request_token_secret
      @cv_token = CvToken.find_or_create_from_request_token(params[:oauth_token], @request_token_secret, params[:oauth_verifier])
      @user = User.find_or_create_by_cv_token(@cv_token)
---
INSERT INTO "users" ("login", "name", "created_at", "updated_at") VALUES('kuba', NULL, '2009-10-16 14:36:26', '2009-10-16 14:36:26')