consumer/app/controllers/user_sessions_controller.rb

  def create
    @request_token_secret = session.delete(:request_token_secret)
    if @request_token_secret
      @user = User.find_or_create_from_request_token(params[:oauth_token], @request_token_secret, params[:oauth_verifier])
---
INSERT INTO "users" ("login", "name", "created_at", "updated_at", "token", "secret") VALUES('kuba', NULL, '2009-10-16 15:16:29', '2009-10-16 15:16:29', 'qktQt3tWQ75cbPJYRhne', 'reZUsckjs905GQ3Ecg5eB8IYqoMJoAjg1dbVe9sq')